createRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:draf="http://xmlns.oracle.com/apps/prc/po/editDocument/flex/draftPurchaseOrderDistribution/" xmlns:draf1="http://xmlns.oracle.com/apps/prc/po/editDocument/flex/draftPurchasingDocumentSchedule/" xmlns:draf2="http://xmlns.oracle.com/apps/prc/po/editDocument/flex/draftPurchasingDocumentLine/" xmlns:draf3="http://xmlns.oracle.com/apps/prc/po/editDocument/flex/draftPurchasingDocumentHeader/" xmlns:pjc="http://xmlns.oracle.com/apps/prc/po/commonPo/flex/PJCPoDraftDistribution/" xmlns:pur="http://xmlns.oracle.com/apps/prc/po/editDocument/purchaseOrderServiceV2/" xmlns:typ="http://xmlns.oracle.com/apps/prc/po/editDocument/purchaseOrderServiceV2/types/">
   <soapenv:Header />
   <soapenv:Body>
      <typ:createPurchaseOrder>
         <typ:createOrderEntry>
            <!--Optional:-->
            <!--Optional:-->
            <pur:ProcurementBusinessUnit>ABG_Australia</pur:ProcurementBusinessUnit>
            <!--Optional:-->
            <pur:RequisitioningBusinessUnit>ABG_Australia</pur:RequisitioningBusinessUnit>
            <!--Optional:-->
            <pur:SoldToLegalEntity>W.T.H. Pty Ltd</pur:SoldToLegalEntity>
            <!--Optional:-->
            <pur:BillToBusinessUnit>ABG_Australia</pur:BillToBusinessUnit>
            <!--Optional:-->
            <pur:BuyerName>Pirvani2, Sahar</pur:BuyerName>
            <!--Optional:-->
            <pur:Supplier>Australia Vehicles Ltd.</pur:Supplier>
            <!--Optional:-->
            <pur:SupplierSiteCode>AUAddress</pur:SupplierSiteCode>
            <pur:BillToLocationCode>ABG AUSTRALIA</pur:BillToLocationCode>
            <!--Optional:-->
            <pur:PurchaseOrderEntryLine>
               <pur:LineTypeId>1</pur:LineTypeId>
               <pur:Quantity>1</pur:Quantity>
               <pur:Price>10</pur:Price>
               <pur:UnitOfMeasure>EA</pur:UnitOfMeasure>
               <pur:ItemDescription>Test</pur:ItemDescription>
               <pur:CategoryName>BSvc.Exp.Meetings/Events.Indirect Meetings And Conferences</pur:CategoryName>
               <pur:PurchaseOrderEntrySchedule>
                  <!--Optional:-->
                  <pur:ScheduleNumber>1</pur:ScheduleNumber>
                  <!--Optional:-->
                  <pur:SupplierOrderLine>1</pur:SupplierOrderLine>
                  <!--Optional:-->
                  <pur:Quantity>1</pur:Quantity>
                  <!--Optional:-->
                  <pur:OrderedAmount>10</pur:OrderedAmount>
                  <!--Optional:-->
                  <pur:ShipToLocationCode>ABG AUSTRALIA</pur:ShipToLocationCode>
                  <!--Optional:-->
                  <pur:ShipToOrganizationCode>ABG_AUST_INV_ORG</pur:ShipToOrganizationCode>
                  <pur:PurchaseOrderEntryDistribution>
                     <!--Optional:-->
                     <pur:DistributionNumber>1</pur:DistributionNumber>
                     <!--Optional:-->
                     <!--Optional:-->
                     <pur:Quantity>1</pur:Quantity>
                     <pur:Price>10</pur:Price>
                     <pur:DeliverToLocationCode>ABG AUSTRALIA</pur:DeliverToLocationCode>
                     <pur:POChargeAccount>3301.150801.70001.1001.401.03.0000.00000</pur:POChargeAccount>
                  </pur:PurchaseOrderEntryDistribution>
               </pur:PurchaseOrderEntrySchedule>
            </pur:PurchaseOrderEntryLine>
         </typ:createOrderEntry>
      </typ:createPurchaseOrder>
   </soapenv:Body>
</soapenv:Envelope>